## Data Wrangling

In [5]:
pip install pandas

Requirement already satisfied: pandas in c:\users\cz 3\anaconda3\lib\site-packages (1.3.4)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\cz 3\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in c:\users\cz 3\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.17.3 in c:\users\cz 3\anaconda3\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: six>=1.5 in c:\users\cz 3\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
pip install seaborn

Requirement already satisfied: seaborn in c:\users\cz 3\anaconda3\lib\site-packages (0.11.2)
Requirement already satisfied: scipy>=1.0 in c:\users\cz 3\anaconda3\lib\site-packages (from seaborn) (1.7.1)
Requirement already satisfied: numpy>=1.15 in c:\users\cz 3\anaconda3\lib\site-packages (from seaborn) (1.20.3)
Requirement already satisfied: matplotlib>=2.2 in c:\users\cz 3\anaconda3\lib\site-packages (from seaborn) (3.4.3)
Requirement already satisfied: pandas>=0.23 in c:\users\cz 3\anaconda3\lib\site-packages (from seaborn) (1.3.4)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\cz 3\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (3.0.4)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\cz 3\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (1.3.1)
Requirement already satisfied: pillow>=6.2.0 in c:\users\cz 3\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (8.4.0)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\cz 3\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (2.8.2)
Requirement already satisfied: cycler>=0.10 in c:\users\cz 3\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn) (0.10.0)
Requirement already satisfied: six in c:\users\cz 3\anaconda3\lib\site-packages (from cycler>=0.10->matplotlib>=2.2->seaborn) (1.16.0)
Requirement already satisfied: pytz>=2017.3 in c:\users\cz 3\anaconda3\lib\site-packages (from pandas>=0.23->seaborn) (2021.3)
Note: you may need to restart the kernel to use updated packages.

In [7]:
pip install numpy

Requirement already satisfied: numpy in c:\users\cz 3\anaconda3\lib\site-packages (1.20.3)
Note: you may need to restart the kernel to use updated packages.

In [28]:
import pandas as pd
import seaborn as sns 
import numpy as np

In [40]:
kashti = sns.load_dataset('titanic')
ks1 = kashti 
ks2 = kashti

In [30]:
ks1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [31]:
ks1.shape

(891, 15)

In [32]:
# Simple operation (Math operator)
(kashti['age']*365).head(10)

0     8030.0
1    13870.0
2     9490.0
3    12775.0
4    12775.0
5        NaN
6    19710.0
7      730.0
8     9855.0
9     5110.0
Name: age, dtype: float64

## Dealing with missing values 
- In a data set missing values are either? or N/A or NAN, or 0 a blank cell.
- jab kabhe data na ho kesi aik row me kisi b aik parameter

### Steps

1. Koshish karen dobara data collect karlen ya dekh ken agar kahee galti hai.
2. Missing value wala col hee nikal den agar data p effect nahe hota ya simple row or data entry remove karden 
3. Replace the missing values:
  1. How?
        1. Average value of entire variable or similar data point.
        2. Frequency or Mode replacement 
        3. Replace based on other function (Data sampler knows that)
        4. ML alg can also be used.
        5. Leave it like that 
   2. Why?
        1. its better because no data is lost 
        2. less accurate

In [33]:
# where exactly missing values are

kashti.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [34]:
print(kashti.shape)
kashti.dropna(subset=['deck'],axis=0, inplace=True)

(891, 15)

In [17]:
kashti.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [36]:
kashti = kashti.dropna()
kashti.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [37]:
kashti.shape

(182, 15)

In [38]:
ks1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [41]:
ks1.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

## Replacing missing values with the average of that col

In [43]:
mean = ks1['age'].mean()
mean

29.69911764705882

In [46]:
# replacing nan with mean of the data 
ks1['age'] = ks1['age'].replace(np.nan , mean)
ks1.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [49]:
mean = ks1['deck'].mean()
mean
ks1['deck']  = ks1['deck'].replace(np.nan , mean)

ks1.isnull().sum()

TypeError: 'Categorical' does not implement reduction 'mean'

## Data Formatting

In [50]:
#know the data type and convert it into the known one

kashti.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [53]:
#Type casting
#Use this method to convert datatypes from one to another format 
kashti['survived'] = kashti['survived'].astype("int64")

In [55]:
#Here we will convert the age into days isntead of years

ks1['age']= ks1['age']*365
ks1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,2930950.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,5062550.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,3463850.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,4662875.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,4662875.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [56]:
#After rename afterwards

ks1.rename(columns={'age': "age in days" }, inplace=True)

ks1.head()

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,2930950.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,5062550.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,3463850.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,4662875.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,4662875.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

## Data Normalization 
- Uniform the data
- Make sure that they have same impact 
- Aik machli samander me or aik jaar me 
- Also for computational reasons

In [57]:
kashti.head()

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,2930950.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,5062550.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,3463850.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,4662875.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,4662875.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [58]:
ks4 =  kashti[["age in days", "fare" ]]
ks4.head()

   age in days     fare
0    2930950.0   7.2500
1    5062550.0  71.2833
2    3463850.0   7.9250
3    4662875.0  53.1000
4    4662875.0   8.0500

- The above Data is really in wide range and we need to normalize and hard to compare 
- Normalization change the values to the range of 0 to 1 (now both variables has similar influence or our model)

## Method of Normalization

1. Simple feature scaling 
    o x(new) = x(old)/x(max)
2. MIn max method
3. Z-core (standard score) -3 to 3
4. Log transformation

In [61]:
#Simple feature scalling

ks4['fare'] =  ks4['fare']/ks4['fare'].max()
ks4['age in days'] =  ks4['age in days']/ks4['age in days'].max()
ks4.head()

C:\Users\CZ3~1\AppData\Local\Temp/ipykernel_19192/752500877.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks4['fare'] =  ks4['fare']/ks4['fare'].max()
C:\Users\CZ3~1\AppData\Local\Temp/ipykernel_19192/752500877.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks4['age in days'] =  ks4['age in days']/ks4['age in days'].max()

   age in days      fare
0       0.2750  0.014151
1       0.4750  0.139136
2       0.3250  0.015469
3       0.4375  0.103644
4       0.4375  0.015713

In [62]:
#Min max method

ks4['fare'] = (ks4['fare']-ks4['fare'].min())/(ks4['fare'].max()-ks4['fare'].min())

ks4.head()

C:\Users\CZ3~1\AppData\Local\Temp/ipykernel_19192/3214273377.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks4['fare'] = (ks4['fare']-ks4['fare'].min())/(ks4['fare'].max()-ks4['fare'].min())

   age in days      fare
0       0.2750  0.014151
1       0.4750  0.139136
2       0.3250  0.015469
3       0.4375  0.103644
4       0.4375  0.015713

In [64]:
#Z-score (Standard score)

ks4['fare'] = (ks4['fare']-ks4['fare'].mean())/ ks4['fare'].std()
ks4.head()

C:\Users\CZ3~1\AppData\Local\Temp/ipykernel_19192/3635430407.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks4['fare'] = (ks4['fare']-ks4['fare'].mean())/ ks4['fare'].std()

   age in days      fare
0       0.2750 -0.502163
1       0.4750  0.786404
2       0.3250 -0.488580
3       0.4375  0.420494
4       0.4375 -0.486064

## Binning

In [66]:
bins = np.linspace(kashti['age']), max(kashti['age']), 15000
age_groups = ["Bachay", "bhooray", "jawan"]
kashti['age'] = pd.cut(kashti['age'], bins, labels=age_groups, include_lowest=True)
kashti['age']

KeyError: 'age'

In [67]:
## COnverting categorical values into dummies 

pd.get_dummies(ks1['sex'])

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]